{
    "marrakech": [
      {
        "id": "ancient_brass_key",
        "name": "Ancient Brass Key",
        "description": "A beautifully crafted key with intricate Moroccan patterns, said to unlock hidden knowledge.",
        "history": "This style of key was used in the ancient medinas to secure valuable goods and manuscripts. The intricate patterns prevented easy duplication.",
        "cultural_significance": "Keys hold symbolic meaning in Moroccan culture, representing access to knowledge and prosperity.",
        "image_file": "marrakech_0.png",
        "associated_puzzle": "marrakech_0"
      },
      {
        "id": "zellige_tile",
        "name": "Zellige Tile Fragment",
        "description": "An authentic piece of Moroccan zellige tilework, showcasing the geometric precision of Islamic art.",
        "history": "Zellige artistry dates back to the 10th century in Morocco. Each tile is hand-cut and positioned to create complex geometric patterns.",
        "cultural_significance": "Zellige represents mathematical harmony and the infinite nature of Allah in Islamic decorative arts.",
        "image_file": "marrakech_1.png",
        "associated_puzzle": "marrakech_1"
      },
      {
        "id": "dyers_palette",
        "name": "Dyer's Palette",
        "description": "A collection of natural dyes used by Moroccan artisans for centuries to create vibrant textiles and art.",
        "history": "Traditional Moroccan dyes are derived from plants, minerals, and insects found throughout North Africa.",
        "cultural_significance": "Each color has symbolic meaning: blue for protection, red for strength, green for peace, yellow for eternity.",
        "image_file": "marrakech_2.png",
        "associated_puzzle": "marrakech_2"
      }
    ],
    "fes": [
      {
        "id": "leather_tool",
        "name": "Leather Craftsman's Tool",
        "description": "A traditional tool used by Fes leather artisans, passed down through generations.",
        "history": "The leather tanneries of Fes have operated since the 9th century using methods largely unchanged over time.",
        "cultural_significance": "Leather crafting represents one of Morocco's most enduring traditional industries and is central to Fes's economic heritage.",
        "image_file": "fes_0.png",
        "associated_puzzle": "fes_0"
      },
      {
        "id": "scholars_medallion",
        "name": "Scholar's Medallion",
        "description": "A medallion worn by scholars of the ancient madrasas, symbolizing mathematical knowledge.",
        "history": "Students at the University of Al Quaraouiyine, founded in 859 CE (the oldest university in the world), would receive similar medallions upon graduation.",
        "cultural_significance": "The medallion's geometric pattern represents the importance of mathematics and astronomy in Islamic scholarship.",
        "image_file": "fes_1.png",
        "associated_puzzle": "fes_1"
      },
      {
        "id": "blue_ceramic_plate",
        "name": "Blue Ceramic Plate",
        "description": "A hand-painted plate from Fes, featuring traditional symbols and the distinctive cobalt blue glaze.",
        "history": "The blue pottery tradition of Fes was influenced by Chinese porcelain brought via Andalusian trade routes in the 14th century.",
        "cultural_significance": "Fes blue ceramics are considered among the finest examples of Moroccan craftsmanship and appear in homes and palaces alike.",
        "image_file": "fes_2.png",
        "associated_puzzle": "fes_2"
      }
    ],
    "chefchaouen": [
      {
        "id": "blue_pigment",
        "name": "Blue Pigment Pouch",
        "description": "A small pouch containing the distinctive blue pigment used on Chefchaouen's buildings.",
        "history": "The tradition of painting buildings blue began with Jewish refugees who settled in Chefchaouen in the 1930s, bringing their custom of using blue to represent the sky and heaven.",
        "cultural_significance": "The blue color is now integral to Chefchaouen's identity and economy, attracting visitors from around the world.",
        "image_file": "chefchaouen_0.png",
        "associated_puzzle": "chefchaouen_0"
      },
      {
        "id": "weaving_comb",
        "name": "Berber Weaving Comb",
        "description": "A traditional wooden tool used by Berber women to create intricate textile patterns.",
        "history": "Berber weaving techniques have been passed from mother to daughter for thousands of years in the Rif Mountains.",
        "cultural_significance": "Women's weaving represents both artistic expression and historical documentation, as patterns often tell stories of tribal history.",
        "image_file": "chefchaouen_1.png",
        "associated_puzzle": "chefchaouen_1"
      },
      {
        "id": "mountain_flute",
        "name": "Rif Mountain Flute",
        "description": "A handcrafted wooden flute used in traditional music of the Rif Mountains.",
        "history": "These flutes are typically made from cedar wood native to the region and feature five to seven finger holes.",
        "cultural_significance": "The distinct melodies of Jebli music reflect the mountain lifestyle and natural surroundings of the Rif region.",
        "image_file": "chefchaouen_2.png",
        "associated_puzzle": "chefchaouen_2"
      }
    ],
    "sahara": [
      {
        "id": "tuareg_compass",
        "name": "Tuareg Compass",
        "description": "A traditional navigation tool used by Saharan nomads, combining astronomical knowledge with practical design.",
        "history": "Tuareg navigators have crossed the vast Sahara for centuries using celestial navigation techniques refined over generations.",
        "cultural_significance": "The compass symbolizes the Tuaregs' mastery of desert survival and their intimate knowledge of the seemingly featureless landscape.",
        "image_file": "sahara_0.png",
        "associated_puzzle": "sahara_0"
      },
      {
        "id": "krakebs",
        "name": "Krakebs",
        "description": "Traditional metal castanets used in Gnawa music, creating the distinctive clicking rhythm of desert ceremonies.",
        "history": "Gnawa music originated with Sub-Saharan slaves brought to Morocco, blending African traditions with Islamic and Berber influences.",
        "cultural_significance": "Gnawa music serves both ceremonial and entertainment purposes, with krakebs providing the hypnotic rhythm for trance-like states during healing rituals.",
        "image_file": "sahara_1.png",
        "associated_puzzle": "sahara_1"
      },
      {
        "id": "indigo_veil",
        "name": "Indigo Veil Fragment",
        "description": "A piece of hand-dyed indigo cloth from a traditional Tuareg tagelmust, with the distinctive deep blue color.",
        "history": "The indigo dye used in Tuareg veils is so intense it can leave a blue tint on the skin, leading to the Tuareg nickname 'Blue Men of the Desert.'",
        "cultural_significance": "The veil is central to Tuareg identity and social interaction, with different wrapping styles conveying specific messages and social status.",
        "image_file": "sahara_2.png",
        "associated_puzzle": "sahara_2"
      }
    ],
    "casablanca": [
      {
        "id": "architectural_blueprint",
        "name": "Architectural Blueprint",
        "description": "A partial blueprint of the Hassan II Mosque showing the fusion of traditional and modern architectural elements.",
        "history": "The Hassan II Mosque, completed in 1993, was designed by French architect Michel Pinseau but incorporates traditional Moroccan design elements throughout.",
        "cultural_significance": "As one of the largest mosques in the world with the tallest minaret, it symbolizes Morocco's commitment to preserving cultural identity while embracing modernity.",
        "image_file": "casablanca_0.png",
        "associated_puzzle": "casablanca_0"
      },
      {
        "id": "gallery_catalog",
        "name": "Gallery Catalog",
        "description": "A rare catalog from the groundbreaking 1969 exhibition in Marrakech's Jemaa el-Fnaa that launched Morocco's contemporary art movement.",
        "history": "The 'Casablanca School' of artists in the 1960s revolutionized Moroccan art by integrating traditional craft techniques with modern abstract concepts.",
        "cultural_significance": "This movement represented Morocco's post-colonial artistic independence and shaped the nation's modern cultural identity.",
        "image_file": "casablanca_1.png",
        "associated_puzzle": "casablanca_1"
      },
      {
        "id": "film_clapperboard",
        "name": "Film Clapperboard",
        "description": "A miniature clapperboard representing Morocco's important role in international cinema.",
        "history": "Since the 1960s, Morocco has been a favored filming location for international productions, with dedicated studios in Ouarzazate.",
        "cultural_significance": "Film production has become an important cultural export and economic driver, showcasing Morocco's diverse landscapes to global audiences.",
        "image_file": "casablanca_2.png",
        "associated_puzzle": "casablanca_2"
      }
    ]
  }